## Data Loading, Storage, and File Formats

In [228]:
import os
a = os.listdir('.')
a

['.ipynb_checkpoints',
 '19-May-2019.ipynb',
 'abc.txt',
 'abc.xml',
 'allData.csv',
 'AllTask.csv',
 'Book1.xlsx',
 'Class Assignment.ipynb',
 'data.csv',
 'data.txt',
 'data1.csv',
 'Home practice.ipynb',
 'index.html',
 'Japanese.xlsx',
 'Marksheet.ipynb',
 'mydata.csv',
 'mydata.sqlite',
 'Numpy.ipynb',
 'Pandas Ch 6.ipynb',
 'Pandas.ipynb',
 'Pandas1.ipynb',
 'Pizza shop.ipynb',
 'pizza.json',
 'store.h5',
 'Students Data.ipynb',
 'sunday.ipynb',
 'Task_1.docx',
 'TAXRATES1.csv',
 'Testing zip.ipynb',
 'Untitled.ipynb',
 'Untitled1.ipynb',
 'Untitled2.ipynb']

In [229]:
import pandas as pd

# read_csv

Load delimited data from a file, URL, or file-like object; use comma as default delimiter

In [230]:
data = pd.read_csv('data1.csv')
data

        Course  Students         Location  Faculty teacher
0           AI      3000       Saylani HQ               30
1          CNC      1056  Saylani Gulshan               14
2  Block Chain      1307          Adamjee               12
3          IOT      2000           Bahria               16

In [231]:
pd.read_csv('data1.csv', header=None) # for Default column names

             0         1                2                3
0       Course  Students         Location  Faculty teacher
1           AI      3000       Saylani HQ               30
2          CNC      1056  Saylani Gulshan               14
3  Block Chain      1307          Adamjee               12
4          IOT      2000           Bahria               16

In [232]:
pd.read_csv('data1.csv', names=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']) # for custom columns

,a,b,c,d,e,f,g,h,i,j
0,Course,Students,Location,Faculty teacher,NaN,NaN,NaN,NaN,NaN,NaN
1,AI,3000,Saylani HQ,30,NaN,NaN,NaN,NaN,NaN,NaN
2,CNC,1056,Saylani Gulshan,14,NaN,NaN,NaN,NaN,NaN,NaN
3,Block Chain,1307,Adamjee,12,NaN,NaN,NaN,NaN,NaN,NaN
4,IOT,2000,Bahria,16,NaN,NaN,NaN,NaN,NaN,NaN

In [233]:
pd.read_csv('data1.csv', index_col='Course') # Indexing through any column

             Students         Location  Faculty teacher
Course
AI               3000       Saylani HQ               30
CNC              1056  Saylani Gulshan               14
Block Chain      1307          Adamjee               12
IOT              2000           Bahria               16

In [234]:
data1 = pd.read_csv('data1.csv', index_col=['Course','Faculty teacher']) # Indexing multiple columns

In [235]:
data1

                             Students         Location
Course      Faculty teacher
AI          30                   3000       Saylani HQ
CNC         14                   1056  Saylani Gulshan
Block Chain 12                   1307          Adamjee
IOT         16                   2000           Bahria

In [236]:
pd.isnull(data1) #if null return True else False

                             Students  Location
Course      Faculty teacher
AI          30                  False     False
CNC         14                  False     False
Block Chain 12                  False     False
IOT         16                  False     False

In [237]:
pd.read_csv('data1.csv', na_values=['CNC']) #na_values m jo bhi data do agar exist krta ho to to wo null m conevrt krdeta hai

        Course  Students         Location  Faculty teacher
0           AI      3000       Saylani HQ               30
1          NaN      1056  Saylani Gulshan               14
2  Block Chain      1307          Adamjee               12
3          IOT      2000           Bahria               16

In [238]:
pd.read_csv('data1.csv', skiprows = 0)

        Course  Students         Location  Faculty teacher
0           AI      3000       Saylani HQ               30
1          CNC      1056  Saylani Gulshan               14
2  Block Chain      1307          Adamjee               12
3          IOT      2000           Bahria               16

In [239]:
pd.read_csv('data1.csv', skipfooter = 2)

C:\Users\Shahzaib\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

  Course  Students         Location  Faculty teacher
0     AI      3000       Saylani HQ               30
1    CNC      1056  Saylani Gulshan               14

# path 
String indicating filesystem location, URL, or file-like object

# sep or delimiter 
Character sequence or regular expression to use to split fields in each row

# header 
Row number to use as column names; defaults to 0 (first row), but should be None if there is no
header row

# index_col 
Column numbers or names to use as the row index in the result; can be a single name/number or a
list of them for a hierarchical index

# names 
List of column names for result, combine with header=None

# skiprows 
Number of rows at beginning of file to ignore or list of row numbers (starting from 0) to skip.

# na_values 
Sequence of values to replace with NA.
# comment 
Character(s) to split comments off the end of lines.

# parse_dates 
Attempt to parse data to datetime; False by default. If True, will attempt to parse all columns.
Otherwise can specify a list of column numbers or name to parse. If element of list is tuple or list, will
combine multiple columns together and parse to date (e.g., if date/time split across two columns).

# keep_date_col 
If joining columns to parse date, keep the joined columns; False by default.
# converters 
Dict containing column number of name mapping to functions (e.g., {'foo': f} would apply the
function f to all values in the 'foo' column).

# dayfirst 
When parsing potentially ambiguous dates, treat as international format (e.g., 7/6/2012 -> June 7,
2012); False by default.
# date_parser 
Function to use to parse dates.

# nrows 
Number of rows to read from beginning of file.
# iterator 
Return a TextParser object for reading file piecemeal.

# chunksize 
For iteration, size of file chunks.
# skip_footer 
Number of lines to ignore at end of file.

# verbose 
Print various parser output information, like the number of missing values placed in non-numeric
# encoding 
Text encoding for Unicode (e.g., 'utf-8' for UTF-8 encoded text).

# squeeze 
If the parsed data only contains one column, return a Series.
# thousands 
Separator for thousands (e.g., ',' or '.').

# Reading Text Files in Pieces

In [240]:
pd.options.display.max_rows = 10 # display maximum 10 rows in output
pd.read_csv('TAXRATES1.csv')

,Unnamed: 0,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
0,0,AK,one,ANCHORAGE BOROUGH,0.0,0.0,0.0,NaN,0.0,1
1,1,AK,one,ANCHORAGE BOROUGH,0.0,NaN,0.0,0.0,0.0,2
2,2,AK,two,ANCHORAGE BOROUGH,0.0,0.0,NaN,0.0,NaN,3
3,3,AK,two,ANCHORAGE BOROUGH,NaN,0.0,0.0,0.0,0.0,4

In [241]:
pd.read_csv('TAXRATES1.csv', nrows=2) # load 2 rows data from file

,Unnamed: 0,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
0,0,AK,one,ANCHORAGE BOROUGH,0,0.0,0,NaN,0,1
1,1,AK,one,ANCHORAGE BOROUGH,0,NaN,0,0.0,0,2

In [242]:
chunkread = pd.read_csv('TAXRATES1.csv', chunksize=2) # To read a file in pieces, specify a chunksize as a number of rows
for i in chunkread:
    print(i)

   Unnamed: 0 State ZipCode      TaxRegionName  StateRate  \
0           0    AK     one  ANCHORAGE BOROUGH          0
1           1    AK     one  ANCHORAGE BOROUGH          0

   EstimatedCombinedRate  EstimatedCountyRate  EstimatedCityRate  \
0                    0.0                    0                NaN
1                    NaN                    0                0.0

   EstimatedSpecialRate  RiskLevel
0                     0          1
1                     0          2
   Unnamed: 0 State ZipCode      TaxRegionName  StateRate  \
2           2    AK     two  ANCHORAGE BOROUGH        0.0
3           3    AK     two  ANCHORAGE BOROUGH        NaN

   EstimatedCombinedRate  EstimatedCountyRate  EstimatedCityRate  \
2                      0                  NaN                  0
3                      0                  0.0                  0

   EstimatedSpecialRate  RiskLevel
2                   NaN          3
3                   0.0          4

In [243]:
import csv
# For any file with a single-character delimiter, you can use Python’s built-in csv module.
# To use it, pass any open file or file-like object to csv.reader:
f = open('data1.csv')
reader = csv.reader(f)
# reader = list(csv.reader(f)) # Without loop
reader

In [244]:
for line in reader:
    print(line)

['Course', 'Students', 'Location', 'Faculty teacher']
['AI', '3000', 'Saylani HQ', '30']
['CNC', '1056', 'Saylani Gulshan', '14']
['Block Chain', '1307', 'Adamjee', '12']
['IOT', '2000', 'Bahria', '16']

In [245]:
with open('data1.csv') as f:
    lines = list(csv.reader(f))
lines

[['Course', 'Students', 'Location', 'Faculty teacher'],
 ['AI', '3000', 'Saylani HQ', '30'],
 ['CNC', '1056', 'Saylani Gulshan', '14'],
 ['Block Chain', '1307', 'Adamjee', '12'],
 ['IOT', '2000', 'Bahria', '16']]

In [246]:
list(range(1,10))

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [247]:
header, values = lines[0], lines[1:]
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'Course': ('AI', 'CNC', 'Block Chain', 'IOT'),
 'Students': ('3000', '1056', '1307', '2000'),
 'Location': ('Saylani HQ', 'Saylani Gulshan', 'Adamjee', 'Bahria'),
 'Faculty teacher': ('30', '14', '12', '16')}

In [248]:
list(zip(*values))

[('AI', 'CNC', 'Block Chain', 'IOT'),
 ('3000', '1056', '1307', '2000'),
 ('Saylani HQ', 'Saylani Gulshan', 'Adamjee', 'Bahria'),
 ('30', '14', '12', '16')]

In [249]:
for h, v in zip(header, zip(*values)):
    print(h)
    print(v)

Course
('AI', 'CNC', 'Block Chain', 'IOT')
Students
('3000', '1056', '1307', '2000')
Location
('Saylani HQ', 'Saylani Gulshan', 'Adamjee', 'Bahria')
Faculty teacher
('30', '14', '12', '16')

# CSV dialect options
## delimiter 
One-character string to separate fields; defaults to ','.
## lineterminator 
Line terminator for writing; defaults to '\r\n'. Reader ignores this and recognizes cross-platform
line terminators.
## quotechar 
Quote character for fields with special characters (like a delimiter); default is '"'.

## quoting 
Quoting convention. Options include csv.QUOTE_ALL (quote all fields), csv.QUOTE_MINI
MAL (only fields with special characters like the delimiter), csv.QUOTE_NONNUMERIC, and
csv.QUOTE_NONE (no quoting). See Python’s documentation for full details. Defaults to
QUOTE_MINIMAL.

## skipinitialspace 
Ignore whitespace after each delimiter; default is False.
## doublequote 
How to handle quoting character inside a field; if True, it is doubled (see online documentation
for full detail and behavior).
## escapechar 
String to escape the delimiter if quoting is set to csv.QUOTE_NONE; disabled by default

# JSON Data 
## (JavaScript Object Notation)

In [250]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""
print(obj)

{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}

In [251]:
import json
result = json.loads(obj)
result1 = json.dumps(result)
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [252]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [253]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

# read_table

Load delimited data from a file, URL, or file-like object; use tab ('\t') as default delimiter

In [254]:
txt = pd.read_table('TAXRATES1.csv')

C:\Users\Shahzaib\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

In [255]:
txt

  ,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
0              0,AK,one,ANCHORAGE BOROUGH,0,0,0,,0,1
1              1,AK,one,ANCHORAGE BOROUGH,0,,0,0,0,2
2               2,AK,two,ANCHORAGE BOROUGH,0,0,,0,,3
3              3,AK,two,ANCHORAGE BOROUGH,,0,0,0,0,4

In [256]:
fwf = pd.read_fwf('TAXRATES1.csv')

# read_fwf
## Read data in fixed-width column format (i.e., no delimiters)
Means same as file

In [257]:
fwf

  ,State,ZipCode,TaxRegionName,StateRate,EstimatedCombinedRate,EstimatedCountyRate,EstimatedCityRate,EstimatedSpecialRate,RiskLevel
0              0,AK,one,ANCHORAGE BOROUGH,0,0,0,,0,1
1              1,AK,one,ANCHORAGE BOROUGH,0,,0,0,0,2
2               2,AK,two,ANCHORAGE BOROUGH,0,0,,0,,3
3              3,AK,two,ANCHORAGE BOROUGH,,0,0,0,0,4

# read_clipboard
Version of read_table that reads data from the clipboard; useful for converting tables from web pages
I copied this***==>
Company	Contact	Country
Alfreds	Maria	Germany
Centro	Francisco	Mexico
Ernst	Roland	Austria
Island	Helen	UK
Laughing	Yoshi	Canada
Magazzini	Giovanni	Italy

In [259]:
clip = pd.read_clipboard()
clip

EmptyDataError: No columns to parse from file

# read_excel
Read tabular data from an Excel XLS or XLSX file
excel ki xlsx ki file se data read krta hai.

In [260]:
pd.read('japanese.xls')

TypeError: 'str' object is not callable

# read_hdf
Read HDF5 files written by pandas

In [261]:
df = pd.DataFrame([[1, 1.0, 'a']], columns=['x', 'y', 'z'])
df.to_hdf('./store.h5','data')

In [262]:
reread = pd.read_hdf('./store.h5')
reread

   x    y  z
0  1  1.0  a

# read_html 
Read all tables found in the given HTML document
HTML file

In [263]:
# %load index.html
<!DOCTYPE html>
<html>
<head>
<style>
table {
  font-family: arial, sans-serif;
  border-collapse: collapse;
  width: 100%;
}

td, th {
  border: 1px solid #dddddd;
  text-align: left;
  padding: 8px;
}

tr:nth-child(even) {
  background-color: #dddddd;
}
</style>
</head>
<body>

<h2>HTML Table</h2>

<table>
  <tr>
    <th>Company</th>
    <th>Contact</th>
    <th>Country</th>
  </tr>
  <tr>
    <td>Alfreds</td>
    <td>Maria</td>
    <td>Germany</td>
  </tr>
  <tr>
    <td>Centro</td>
    <td>Francisco</td>
    <td>Mexico</td>
  </tr>
  <tr>
    <td>Ernst</td>
    <td>Roland</td>
    <td>Austria</td>
  </tr>
  <tr>
    <td>Island</td>
    <td>Helen</td>
    <td>UK</td>
  </tr>
  <tr>
    <td>Laughing</td>
    <td>Yoshi</td>
    <td>Canada</td>
  </tr>
  <tr>
    <td>Magazzini</td>
    <td>Giovanni</td>
    <td>Italy</td>
  </tr>
</table>

</body>
</html>

SyntaxError: invalid syntax (<ipython-input-263-6cb2b23858e8>, line 2)

In [ ]:
htmlReader = pd.read_html('index.html')
htmlReader

# read_json 
Read data from a JSON (JavaScript Object Notation) string representation.

In [ ]:
# %load data.json
{"columns":["col 1","col 2"],
  "index":["row 1","row 2"],
  "data":[["a","b"],["c","d"]]}

In [ ]:
readJson = pd.read_json('data.json')
readJson

# read_msgpack 
Read pandas data encoded using the MessagePack binary format
# read_pickle 
Read an arbitrary object stored in Python pickle format
# read_sas 
Read a SAS dataset stored in one of the SAS system’s custom storage formats
# read_sql 
Read the results of a SQL query (using SQLAlchemy) as a pandas DataFrame
# read_stata 
Read a dataset from Stata file format
# read_feather 
Read the Feather binary file format

# XML and HTML: Web Scraping

In [266]:
tables = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')
pd.DataFrame(tables[0])

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","October 25, 2019"
1,"Louisa Community Bank, Inc.",Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","October 25, 2019"
2,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
3,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
4,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
...,...,...,...,...,...,...,...
553,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
554,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
555,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
556,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
557,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [267]:
len(tables)

1

In [268]:
failures = tables[0]
failures

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","October 25, 2019"
1,"Louisa Community Bank, Inc.",Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","October 25, 2019"
2,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
3,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
4,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"
...,...,...,...,...,...,...,...
553,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
554,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
555,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
556,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
557,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [269]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019","October 25, 2019"
1,"Louisa Community Bank, Inc.",Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019","October 25, 2019"
2,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","August 22, 2019"
3,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","July 24, 2019"
4,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","August 12, 2019"

In [270]:
close_timestamps = pd.to_datetime(failures['Closing Date'])
close_timestamps

0     2019-10-25
1     2019-10-25
2     2019-05-31
3     2017-12-15
4     2017-10-13
         ...
553   2001-07-27
554   2001-05-03
555   2001-02-02
556   2000-12-14
557   2000-10-13
Name: Closing Date, Length: 558, dtype: datetime64[ns]

In [271]:
dateCount = close_timestamps.dt.date.value_counts() #Count Dates in this column
dayCount = close_timestamps.dt.day.value_counts() #Count Days in this column
monthCount = close_timestamps.dt.month.value_counts() #Count months in this column
yearCount = close_timestamps.dt.year.value_counts() #Count years in this column
dateCount

2009-10-30    9
2010-04-16    8
2010-08-20    8
2010-07-23    7
2010-04-23    7
             ..
2009-11-20    1
2015-02-27    1
2004-03-19    1
2009-05-08    1
2017-12-15    1
Name: Closing Date, Length: 253, dtype: int64

In [273]:
dayCount

23    31
30    30
19    30
20    27
17    23
      ..
12    10
9     10
31     9
1      8
3      4
Name: Closing Date, Length: 31, dtype: int64

In [272]:
monthCount

7     74
10    61
4     59
1     51
5     44
      ..
3     40
9     38
6     36
12    35
11    35
Name: Closing Date, Length: 12, dtype: int64

In [274]:
yearCount

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2019      3
2003      3
2007      3
2000      2
Name: Closing Date, Length: 17, dtype: int64

# Parsing XML with lxml.objectify
## XML (eXtensible Markup Language)

In [278]:
from lxml import objectify
parsed = objectify.parse(open('abc.xml'))
root = parsed.getroot()
root

In [279]:
data = []
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
'DESIRED_CHANGE', 'DECIMAL_PLACES']
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
#         print(child.tag)
#         print(child.pyval)
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [277]:
data

[{'AGENCY_NAME': 'Metro-North Railroad',
  'INDICATOR_NAME': 'Escalator Availability',
  'DESCRIPTION': 'Percent of the time that escalators are operational\nsystemwide. The availability rate is based on physical observations performed\nthe morning of regular business days only. This is a new indicator the agency\nbegan reporting in 2009.',
  'PERIOD_YEAR': 2011,
  'PERIOD_MONTH': 12,
  'CATEGORY': 'Service Indicators',
  'FREQUENCY': 'M',
  'INDICATOR_UNIT': '%',
  'YTD_TARGET': 97.0,
  'YTD_ACTUAL': '',
  'MONTHLY_TARGET': 97.0,
  'MONTHLY_ACTUAL': ''}]

In [280]:
from io import StringIO
tag = '<a href="http://www.google.com" target="_blank">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [281]:
root.get('href')

'http://www.google.com'

In [282]:
root.text

'Google'

In [283]:
xlsx = pd.ExcelFile('Book1.xlsx')

In [284]:
pd.read_excel(xlsx, 'Sheet1')

,Unnamed: 0,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,0,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019","June 18, 2019"
1,1,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017","February 1, 2019"
2,2,The Farmers and Merchants State Bank of Argonia,Argonia,KS,17719,Conway Bank,"October 13, 2017","February 21, 2018"
3,3,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb","May 26, 2017","January 29, 2019"
4,4,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,"May 5, 2017","March 22, 2018"
...,...,...,...,...,...,...,...,...
551,551,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014"
552,552,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002"
553,553,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003"
554,554,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005"
555,555,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005"

In [285]:
writer = pd.ExcelWriter('Book1.xlsx')
failures.to_excel(writer,'Sheet1')
writer.save()

# Interacting with Web APIs

In [ ]:
import requests

In [ ]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)

In [ ]:
data = resp.json()
data

In [ ]:
data[0]['title']

In [ ]:
issues = pd.DataFrame(data, columns=['number', 'title','labels', 'state'])
issues

# Interacting with Databases

In [ ]:
import sqlite3
query = """
    CREATE TABLE test
    (a VARCHAR(20), b VARCHAR(20),
    c REAL, d INTEGER);"""

In [ ]:
print(query)

In [ ]:
con = sqlite3.connect('mydata.sqlite')

In [ ]:
con.execute(query)

In [ ]:
con.commit()

In [ ]:
data = [('Atlanta', 'Georgia', 1.25, 6),
('Tallahassee', 'Florida', 2.6, 3),
('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [ ]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows